const CallState = {
  callout: 0,
  callin: 1,
  call: 2
}

const MediaType = {
  audio: 0,
  video: 1
}

const Reason = {
  0: '己方取消已发出的通话请求',

  1: '己方拒绝收到的通话请求',

  2: '己方挂断',

  3: '己方忙碌',

  4: '己方未接听',

  5: '己方不支持当前引擎',

  6: '己方网络出错',

  7: '己方获取媒体资源失败',

  8: '己方发布资源失败',

  9: '己方订阅资源失败',

  10: '对方取消已发出的通话请求',

  11: '对方拒绝收到的通话请求',

  12: '通话过程对方挂断',

  13: '对方忙碌',

  14: '对方未接听',

  15: '对方不支持当前引擎',

  16: '对方网络错误',

  17: '对方获取媒体资源失败',

  18: '对方发布资源失败',

  19: '对方订阅资源失败',

  20: '己方其他端已加入新通话',

  21: '己方其他端已在通话中',

  22: '己方已被禁止通话',

  23: '对方其他端已加入新通话',

  24: '对方其他端已在通话中',

  25: '对方已被禁止通话',

  26: '己方其他端已接听',

  27: '己方其他端已挂断',

  28: '己方被对方加入黑名单',

  29: '音视频服务已关闭',

  30: '己方被降级为观察者',

  31: '己方摄像头初始化错误，可能是没有打开使用摄像头权限',

  32: '其他端已经接听',

  33: 'im ipc服务已断开'

}

module.exports = {
  CallState,
  MediaType,
  Reason
}
